---
kind: other
id: Properties.T:Autodesk.Revit.DB.KeyBasedTreeEntry
source: html/582d81cf-2fad-2429-2a2b-d8a33aa4cdeb.htm
---
# KeyBasedTreeEntry Properties

Specifies whether the .NET object represents a valid Revit entity.